In [3]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [7]:
lst = ["name1","name2","name3"] 
s = pd.Series(lst, index=[1,2,3])
s

1    name1
2    name2
3    name3
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [8]:
s.index = [11,12,13]
s

11    name1
12    name2
13    name3
dtype: object

## Q3: Retrieve First and second elements.

In [18]:
print(s[11], s[12])
s[0:2]

name1 name2

11    name1
12    name2
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [19]:
z = pd.concat([s, s])
z

11    name1
12    name2
13    name3
11    name1
12    name2
13    name3
dtype: object

In [22]:
z.drop_duplicates(inplace=True)
z

11    name1
12    name2
13    name3
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [47]:
dt = pd.DataFrame(columns=['ID', 'Name', 'Age'])
dt

Empty DataFrame
Columns: [ID, Name, Age]
Index: []

## Q6: Read educ_figdp_1_Data.csv file

In [26]:
educ = pd.read_csv('educ_figdp_1_Data.csv')
educ

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [41]:
#loc

In [42]:
educ.loc[5.00] #more useful when the index is not numeric

TIME                                                               2005
GEO                                       European Union (28 countries)
INDIC_ED              Total public expenditure on education as % of ...
Value                                                              4.92
Flag and Footnotes                                                    e
Name: 5, dtype: object

In [43]:
educ.loc[1:4] # the end index is included

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [44]:
#slice

In [45]:
educ['TIME'] #get entire column

0      2000
1      2001
2      2002
3      2003
4      2004
       ...
379    2007
380    2008
381    2009
382    2010
383    2011
Name: TIME, Length: 384, dtype: int64

In [46]:
educ[1:4] # the end index is not included

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e